app/controllers/lottery_controller.rb

INSERT INTO "lottery_records" ("ucode", "uc", "signature", "terminalid", "result") VALUES (?, ?, ?, ?, ?)  [["ucode", "18"], ["uc", "1-JLNNSWS["], ["signature", "goodview"], ["terminalid", "iPhone"], ["result", "1"]]
---
	def signal

		url = 'http://www.gvbyc.com/gvhappymacau/raffle/start'
	    body = my_post(url,
	    params[:uCode],
	    JSON.generate({:uc => params[:uc],:ti => params[:ti]}),

	    params[:terminalId],
	    params[:signature])
		puts JSON.generate({:uc => params[:uc],:ti => params[:ti]})
		msg = JSON.parse(body)["msg"]

		if msg == "msg22"
			LotteryRecord.create(ucode:params[:uCode],uc:params[:uc],signature:params[:signature],terminalid:params[:terminalId],ti:params[:ti],timestamp:DateTime.now.to_date,result:"1")