app/controllers/lottery_record_controller.rb

SELECT COUNT(*) FROM "lottery_records" WHERE (result=1)
SELECT "lottery_records".* FROM "lottery_records" WHERE (result=1)
SELECT COUNT(*) AS count_all, timestamp AS timestamp FROM "lottery_records" GROUP BY "lottery_records"."timestamp"
SELECT COUNT(*) AS count_all, signature AS signature FROM "lottery_records" GROUP BY "lottery_records"."signature"
---
    def index
    @total_count = LotteryRecord.count
    @lottery_records = LotteryRecord.where("result=1")
    @bingo_count = @lottery_records.count
    @count_data = LotteryRecord.group(:timestamp).count
    @signature_data = LotteryRecord.group(:signature).count